Revit 2026 API

# gbXMLSpaceType Enumeration

---

This enumeration corresponds to the spaceType attribute in gbXML. The enumerated attribute identifies the type of space defined and allows to better approximate the actual internal loads and schedules associated with the defined space type.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum gbXMLSpaceType
```
```vb
Public Enumeration gbXMLSpaceType
```
```cpp
public enum class gbXMLSpaceType
```
```fsharp
type gbXMLSpaceType
```

| Member name | Value | Description |
| --- | --- | --- |
| ActiveStorage | 0 |  |
| ActiveStorageHospitalOrHealthcare | 1 |  |
| AirOrTrainOrBusBaggageArea | 2 |  |
| AirportConcourse | 3 |  |
| AtriumEachAdditionalFloor | 4 |  |
| AtriumFirstThreeFloors | 5 |  |
| AudienceOrSeatingAreaAuditorium | 16 |  |
| AudienceOrSeatingAreaConventionCenter | 10 |  |
| AudienceOrSeatingAreaCourtHouse | 15 |  |
| AudienceOrSeatingAreaExerciseCenter | 7 |  |
| AudienceOrSeatingAreaGymnasium | 8 |  |
| AudienceOrSeatingAreaMotionPictureTheatre | 11 |  |
| AudienceOrSeatingAreaPenitentiary | 6 |  |
| AudienceOrSeatingAreaPerformingArtsTheatre | 12 |  |
| AudienceOrSeatingAreaPoliceOrFireStations | 14 |  |
| AudienceOrSeatingAreaReligious | 13 |  |
| AudienceOrSeatingAreaSportsArena | 9 |  |
| BankCustomerArea | 17 |  |
| BankingActivityAreaOffice | 18 |  |
| BarberAndBeautyParlor | 19 |  |
| CardFileAndCataloguingLibrary | 20 |  |
| ClassroomOrLectureOrTraining | 22 |  |
| ClassroomOrLectureOrTrainingPenitentiary | 21 |  |
| ConferenceMeetingOrMultipurpose | 25 |  |
| ConfinementCellsCourtHouse | 24 |  |
| ConfinementCellsPenitentiary | 23 |  |
| CorridorOrTransition | 26 |  |
| CorridorOrTransitionManufacturingFacility | 27 |  |
| CorridorsWithPatientWaitingExamHospitalOrHealthcare | 28 |  |
| CourtroomCourtHouse | 30 |  |
| CourtSportsAreaSportsArena | 29 |  |
| CustomizeSpaceType | -2 |  |
| DepartmentStoreSalesAreaRetail | 31 |  |
| DetailedManufacturingFacility | 32 |  |
| DiningArea | 33 |  |
| DiningAreaCivilServices | 40 |  |
| DiningAreaFamilyDining | 35 |  |
| DiningAreaHotel | 34 |  |
| DiningAreaLoungeOrLeisureDining | 36 |  |
| DiningAreaMotel | 37 |  |
| DiningAreaPenitentiary | 39 |  |
| DiningAreaTransportation | 38 |  |
| DormitoryBedroom | 41 |  |
| DormitoryStudyHall | 42 |  |
| DressingOrLockerOrFittingRoomAuditorium | 46 |  |
| DressingOrLockerOrFittingRoomCourtHouse | 44 |  |
| DressingOrLockerOrFittingRoomExerciseCenter | 47 |  |
| DressingOrLockerOrFittingRoomGymnasium | 43 |  |
| DressingOrLockerOrFittingRoomPerformingArtsTheatre | 45 |  |
| ElectricalOrMechanical | 48 |  |
| ElevatorLobbies | 49 |  |
| EmergencyHospitalOrHealthcare | 50 |  |
| EquipmentRoomManufacturingFacility | 51 |  |
| ExamOrTreatmentHospitalOrHealthcare | 52 |  |
| ExerciseAreaExerciseCenter | 53 |  |
| ExerciseAreaGymnasium | 54 |  |
| ExhibitSpaceConventionCenter | 55 |  |
| FellowshipHallReligiousBuildings | 56 |  |
| FineMaterialWarehouse | 57 |  |
| FineMerchandiseSalesAreaRetail | 58 |  |
| FireStationEngineRoomPoliceOrFireStation | 59 |  |
| FoodPreparation | 60 |  |
| GarageServiceOrRepairAutomotiveFacility | 61 |  |
| GeneralExhibitionMuseum | 64 |  |
| GeneralHighBayManufacturingFacility | 62 |  |
| GeneralLowBayManufacturingFacility | 63 |  |
| HospitalNurseryHospitalOrHealthcare | 65 |  |
| HospitalOrMedicalSuppliesHospitalOrHealthcare | 66 |  |
| HospitalOrRadiologyHospitalOrHealthcare | 67 |  |
| HotelOrConferenceCenterConferenceOrMeeting | 68 |  |
| InactiveStorage | 69 |  |
| JudgesChambersCourtHouse | 70 |  |
| LaboratoryOffice | 71 |  |
| LaundryIroningAndSorting | 72 |  |
| LaundryWashingHospitalOrHealthcare | 73 |  |
| LibraryAudioVisualLibraryAudioVisual | 74 |  |
| LivingQuartersDormitory | 75 |  |
| LivingQuartersHotel | 77 |  |
| LivingQuartersMotel | 76 |  |
| Lobby | 78 |  |
| LobbyAuditorium | 81 |  |
| LobbyHotel | 84 |  |
| LobbyMotionPictureTheatre | 80 |  |
| LobbyPerformingArtsTheatre | 82 |  |
| LobbyPostOffice | 83 |  |
| LobbyReligiousBuildings | 79 |  |
| LoungeOrRecreation | 85 |  |
| MallConcourseSalesAreaRetail | 86 |  |
| MassMerchandisingSalesAreaRetail | 87 |  |
| MediumOrBulkyMaterialWarehouse | 88 |  |
| MerchandisingSalesAreaRetail | 89 |  |
| MuseumAndGalleryStorage | 90 |  |
| NoOfSpaceTypes | 125 |  |
| NoSpaceType | -1 |  |
| NurseStationHospitalOrHealthcare | 91 |  |
| OfficeCommonActivityAreasInactiveStorage | 94 |  |
| OfficeEnclosed | 92 |  |
| OfficeOpenPlan | 93 |  |
| OperatingRoomHospitalOrHealthcare | 95 |  |
| OtherTelevisedPlayingAreaSportsArena | 96 |  |
| ParkingAreaAttendantOnlyParkingGarage | 97 |  |
| ParkingAreaPedestrianParkingGarage | 98 |  |
| PatientRoomHospitalOrHealthcare | 99 |  |
| PersonalServicesSalesAreaRetail | 100 |  |
| PharmacyHospitalOrHealthcare | 101 |  |
| PhysicalTherapyHospitalOrHealthcare | 102 |  |
| PlayingAreaGymnasium | 103 |  |
| Plenum | 104 |  |
| PoliceStationLaboratoryPoliceOrFireStations | 105 |  |
| PublicAndStaffLoungeHospitalOrHealthcare | 106 |  |
| ReadingAreaLibrary | 107 |  |
| ReceptionOrWaitingHotel | 110 |  |
| ReceptionOrWaitingMotel | 109 |  |
| ReceptionOrWaitingTransportation | 108 |  |
| RecoveryHospitalOrHealthcare | 111 |  |
| RestorationMuseum | 112 |  |
| Restrooms | 113 |  |
| RingSportsAreaSportsArena | 114 |  |
| SleepingQuartersPoliceOrFireStation | 115 |  |
| SortingAreaPostOffice | 116 |  |
| SpecialtyStoreSalesAreaRetail | 117 |  |
| StacksLibrary | 118 |  |
| StairsInactive | 119 |  |
| Stairway | 120 |  |
| SupermarketSalesAreaRetail | 121 |  |
| TerminalTicketCounterTransportation | 122 |  |
| WorkshopWorkshop | 123 |  |
| WorshipPulpitChoirReligious | 124 |  |

#### Reference

Autodesk.Revit.DB.Analysis Namespace